export default function Description() {
  return (
    <div className="flex flex-col gap-[24px] text-[16px]">
      <p>
        เราได้นำหัวข้อยอดนิยมจากแบบสอบถามออนไลน์มาตั้งเป็นหัวข้อหลักสำหรับตั้งต้นข้อถกเถียง
        ทั้งแบบออนไลน์ในเว็บไซต์นี้ หรือวงพูดคุยที่จัดโดยผู้จัดกระบวนการภายนอก
        ทั้งสื่อมวลชน นักวิชาการ และองค์กรภาคประชาสังคม
      </p>
      <h4 className="wv-ibmplex wv-bold text-[24px]">
        โครงสร้างข้อถกเถียงแบบนี้ คืออะไร?
      </h4>
      <p>
        โครงสร้างข้อถกเถียง เปิดโอกาสให้เราต่อยอดบทสนทนาร่วมกันจนกลายเป็นภาพใหญ่
        ด้วยกาารใช้เหตุผลประสานความคิดเห็นหนึ่งสู่ความคิดเห็นหนึ่ง
        การให้เหตุผลสนับสนุน (เห็นด้วย) ตั้งเงื่อนไข (เห็นด้วยบางส่วน)
        หรือคัดค้าน (ไม่เห็นด้วย) จะทำให้ทุกคนยังสามารถคุยเรื่องเดียวกันอยู่
        แม้จะเห็นต่างกัน
        เพื่อไม่ให้ความคิดเห็นทั้งหลายกระจัดกระจายกลายเป็นคนละเรื่อง
        หรือออกนอกลู่ไปสู่ข้อคิดเห็นที่ไม่มีเหตุผลรองรับ
      </p>
      <p>
        ในพื้นที่นี้ของ Dream Con เหตุผลของแต่ละคนจะได้ปะทะ เรียงร้อย ส่งเสริม
        และแตกยอดเป็นทางเลือกอื่นๆ ต่อไป
      </p>
      <p>
        โครงสร้างข้อถกเถียงไม่ได้มุ่งหวังเพียงแต่จะหาจุดยืนร่วมหรือข้อคิดเห็นยอดนิยม
        แต่ทำให้คนทุกคนสามารถเข้าร่วมบทสนทนาได้ไม่ว่าจะเป็นใครมาจากไหน และได้
        'ทำความเข้าใจ' ความคิดเห็นที่แตกต่างหลากหลายซึ่งอยู่ในสังคมเรา
      </p>
    </div>
  );
}
