import React from "react";
import Masonry from "@mui/lab/Masonry";

export default function TopicWrapper() {
  return (
    <div className="w-full h-full p-[24px]">
      <div className="w-[637px]">
        <Masonry columns={3} spacing={4}>
          <div className="bg-white rounded-[16px] w-[196px] p-[24px] h-[770px]">
            1 สสร. ควรเป็นกระบวนกร เปิดกว้าง ไม่จำเป็นต้องคนเก่ง ถ้าเลือกเอา
            คนเก่งเขาก็จะเอาไอเดียตัวเองใส่ในร่างรัฐธรรมนูญ
          </div>
          <div className="bg-white rounded-[16px] w-[196px] p-[24px] h-[450px]">
            2 สสร. ควรเป็นกระบวนกร เปิดกว้าง ไม่จำเป็นต้องคนเก่ง ถ้าเลือกเอา
            คนเก่งเขาก็จะเอาไอเดียตัวเองใส่ในร่างรัฐธรรมนูญ
          </div>
          <div className="bg-white rounded-[16px] w-[196px] p-[24px] h-[550px]">
            3 สสร. ควรเป็นกระบวนกร เปิดกว้าง ไม่จำเป็นต้องคนเก่ง ถ้าเลือกเอา
            คนเก่งเขาก็จะเอาไอเดียตัวเองใส่ในร่างรัฐธรรมนูญ
          </div>
          <div className="bg-white rounded-[16px] w-[196px] p-[24px] h-[350px]">
            4 สสร. ควรเป็นกระบวนกร เปิดกว้าง ไม่จำเป็นต้องคนเก่ง ถ้าเลือกเอา
            คนเก่งเขาก็จะเอาไอเดียตัวเองใส่ในร่างรัฐธรรมนูญ
          </div>
          <div className="bg-white rounded-[16px] w-[196px] p-[24px] h-[250px]">
            5 สสร. ควรเป็นกระบวนกร เปิดกว้าง ไม่จำเป็นต้องคนเก่ง ถ้าเลือกเอา
            คนเก่งเขาก็จะเอาไอเดียตัวเองใส่ในร่างรัฐธรรมนูญ
          </div>
          <div className="bg-white rounded-[16px] w-[196px] p-[24px] h-[350px]">
            6 สสร. ควรเป็นกระบวนกร เปิดกว้าง ไม่จำเป็นต้องคนเก่ง ถ้าเลือกเอา
            คนเก่งเขาก็จะเอาไอเดียตัวเองใส่ในร่างรัฐธรรมนูญ
          </div>
          <div className="bg-white rounded-[16px] w-[196px] p-[24px] h-[450px]">
            7 สสร. ควรเป็นกระบวนกร เปิดกว้าง ไม่จำเป็นต้องคนเก่ง ถ้าเลือกเอา
            คนเก่งเขาก็จะเอาไอเดียตัวเองใส่ในร่างรัฐธรรมนูญ
          </div>
          <div className="bg-white rounded-[16px] w-[196px] p-[24px] h-[350px]">
            8 สสร. ควรเป็นกระบวนกร เปิดกว้าง ไม่จำเป็นต้องคนเก่ง ถ้าเลือกเอา
            คนเก่งเขาก็จะเอาไอเดียตัวเองใส่ในร่างรัฐธรรมนูญ
          </div>
          <div className="bg-white rounded-[16px] w-[196px] p-[24px] h-[250px]">
            9 สสร. ควรเป็นกระบวนกร เปิดกว้าง ไม่จำเป็นต้องคนเก่ง ถ้าเลือกเอา
            คนเก่งเขาก็จะเอาไอเดียตัวเองใส่ในร่างรัฐธรรมนูญ
          </div>
          <div className="bg-white rounded-[16px] w-[196px] p-[24px] h-[770px]">
            10 สสร.
          </div>
        </Masonry>
      </div>
    </div>
  );
}
